<template>
	<div class="agreement"  :style="'padding-top:'+navgationHeight+'px;min-height:100vh;'">
		<stm-nav></stm-nav>
		<h6>欢迎使用一生名片软件及服务！</h6>
		<div class="main">
			为使用一生名片软件（以下简称“本软件”）及服务，你应当阅读并遵守《一生名片软件许可及服务协议》（以下简称“本协议”）。请你务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款，以及开通或使用某项服务的单独协议，并选择接受或不接受。除非你已阅读并接受本协议所有条款，否则你无权下载、安装或使用本软件及相关服务。你的下载、安装、使用、获取一生名片帐号、登录等行为即视为你已阅读并同意上述协议的约束。如果你未满18周岁，请在法定监护人的陪同下阅读本协议及其他上述协议，并特别注意未成年人使用条款。
			<br/>
			一、协议的范围	<br/>
			1.1 协议适用主体范围	<br/>
			本协议是你与一生名片之间关于你使用、复制本软件相关服务所订立的协议。	<br/>

			二、关于本服务	<br/>

			2.1 本服务的内容	<br/>

				<br/>2.1.1本服务内容是上海遇川实业发展有限公司向用户提供的跨平台的电子名片＋移动社交软件，它是一个能创建电子名片、管理电子名片、发送电子名片的工具，同时，你可以通过一生名片的社交功能结识新朋友。

				<br/>2.1.2 一生名片客户端功能：

				<br/>1、创建名片

			基础功能：通联资料
				<br/> * 可创建多个不同角色名片
				<br/> * 创建个人形象：图片
				<br/> * 创建公司、职务、电话、固话、邮箱
				<br/> * 支持添加多个不同公司及兼任职位
				<br/> * 支持地址自动定位功能

			特色功能：个人超媒体
				<br/> * 创建个性化封面及标题
				<br/> * 支持所有多媒体元素类型和格式
				<br/> * 整篇文章自动拆分段落功能
				<br/> * 支持上传图片、文本、音乐、视频
				<br/> * 强大的文本自由编辑排版功能
				<br/> * 提供令人惊叹的动效展板

			名片编辑功能：
				<br/> * 最多可创建5张不同角色名片
				<br/> * 发送无限制，永远发不完
				<br/> * 可随时重复编辑、修改、同步更新
				<br/> * 可删除或设为默认名片
				<br/> * 每张名片自动生成永久二维码
				<br/> * 可一键添加名片到手机桌面

			数据统计功能：
				<br/> * 可查看名片发送数量及被打开数量
				<br/> * 可查看名片总访问量
				<br/> * 可查看最近7天的访问统计图
				<br/> * 可查看今日、本周、本月访问数


				<br/>2、发名片：
				<br/> * 面对面发名片：向上一推，系统即自动交换名片。
				<br/> * 拍照发名片：拍一下对方的名片，你的名片就自动发送给对方。
				<br/> * 扫码发名片：扫二维码码即发送。
				<br/> * 拨号发名片：输入对方手机号码，即可自动发送给对方。

				<br/>3、对方接收名片
				<br/> * 对方无需下载任何软件
				<br/> * 对方可通过手机短信、微信、QQ、浏览器等直接打开名片
				<br/> * 对方可一键保存名片到手机通讯录，可以连头像一起保存

				<br/>4、查看名片
				<br/> * 动效展示名片详情
				<br/> * 可直接拨打对方电话
				<br/> * 可直接保存到手机通讯录
				<br/> * 可直接通过地址定位查看路线导航
				<br/> * 可查看个人超媒体
				<br/> * 可通过名片与对方聊天
				<br/> * 可查看对方发布的公开动态

				<br/>5、摇一摇交友
			摇一摇，就会自动为你匹配你希望结交的全国各地朋友，你需要先设定目标条件，系统会自动从系统用户中帮你寻找。
			可设定条件：
				<br/> * 行业
				<br/> * 所在地区
				<br/> * 性别及年龄
				<br/> * 职务

				<br/>6、名片夹
			通过名片夹可以整理你交换或接收到的名片，你可以随时查看名片，以及名片主人的公开动态。主要功能：
				<br/> * 可收藏名片
				<br/> * 查看名片详情
				<br/> * 管理、添加、删除及排序
				<br/> * 关键词搜索查找名片

				<br/>7、发现、人脉圈
			这里是公开的用户社区，为用户们提供彼此增进了解的社交平台，你可以：
				<br/> * 发表圈子动态，支持图文、视频
				<br/> * 发起投票，还能添加现金彩蛋，
				<br/> * 发圈子红包，大家一起抢
				<br/> * 打赏别人发表的圈子
				<br/> * 用图片、视频回复评论
				<br/> * 发表超媒体文章

				<br/>8、聊天
			强大的即时聊天功能：
				<br/> * 支持发送图文、影音多媒体消息
				<br/> * 不用加好友，无限好友数量
				<br/> * 给好友发现金红包
				<br/> * 查看好友在线状态
				<br/> * 查看好友发布的圈子日志

				<br/>2.3 本服务许可的范围

				<br/>2.3.1 一生名片给予你一项个人的、不可转让及非排他性的许可，以使用本软件。

				<br/>2.3.2 你不可以为了使用本软件及服务的目的复制本软件的任何副本。除非获得本软件开发商的书面授权认可，否则将被追诉相关的法律责任。

				<br/>2.3.3 本条及本协议其他条款未明示授权的其他一切权利仍由上海遇川实业发展有限公司保留，如果未行使前述任何权利，并不构成对该权利的放弃。

				<br/>2.3.4  用户使用本软件产生的所有个人数据属于用户自己所有，用户可以自由编辑、删除、销毁或复制。

			三、软件的获取

				<br/>3.1 一生名片客户端通过苹果及安卓应用市场来发布，你可以通过上述应用商店下载本软件。

			四、软件的更新

				<br/>4.1 为了改善用户体验、完善服务内容，一生名片将不断努力开发新的服务，并为你及时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。

				<br/>4.2 为了保证本软件及服务的安全性和功能的一致性，一生名片有权不经向你特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。

				<br/>4.3 本软件新版本发布后，旧版本的软件可能无法使用。一生名片不保证旧版本软件继续可用及相应的客户服务，请你随时核对并使用最新版本。

			五、用户个人信息保护

				<br/>5.1 保护用户个人信息是一生名片的一项基本原则，一生名片将会采取合理的措施保护用户的个人信息。除法律法规规定的情形外，未经用户许可一生名片不会向第三方公开、透露用户个人信息。一生名片对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。

				<br/>5.2 你在注册帐号或使用本服务的过程中，需要提供一些必要的信息，例如：为向你提供帐号注册服务或进行用户身份识别，需要你填写手机号码；若国家法律法规或政策有特殊规定的，你需要提供真实的身份信息。若你提供的信息不完整，则无法使用本服务或在使用过程中受到限制。

				<br/>5.3 一般情况下，你可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，你可能无法修改注册时提供的初始注册信息及其他验证信息。

				<br/>5.4 一生名片将运用各种安全技术和程序建立完善的管理制度来保护你的个人信息，以免遭受未经授权的访问、使用或披露。

				<br/>5.5 未经你的同意，一生名片不会向一生名片以外的任何公司、组织和个人披露你的个人信息，但法律另有规定的除外。

				<br/>5.6 一生名片非常重视对未成年人个人信息的保护。若你是18周岁以下的未成年人，在使用一生名片的服务前，应事先取得你家长或法定监护人的书面同意。

			六、主权利义务条款

				<br/>6.1 帐号使用规范

				<br/>6.1.1 你在使用本服务前需要注册一个账号，该账号为你的手机号码，我们需要通过短信验证码来确认你拥有该手机号码。

				<br/>6.1.2 一生名片软件所有权归上海遇川实业发展有限公司所有，用户完成申请注册手续后，仅获得一生名片帐号的使用权，且该使用权仅属于初始申请注册人。同时，初始申请注册人不得赠与、借用、租用、转让或售卖此帐号或者以其他方式许可非初始申请注册人使用此帐号。非初始申请注册人不得通过受赠、继承、承租、受让或者其他任何方式使用此帐号。

				<br/>6.1.3 用户有责任妥善保管注册帐户信息及帐户密码的安全，用户需要对注册帐户以及密码下的行为承担法律责任。用户同意在任何情况下不向他人透露帐户及密码信息。当在你怀疑他人在使用你的帐号时，你应立即通知一生名片官方客服。

				<br/>6.2 用户注意事项

				<br/>6.2.1 你理解并同意：为了向你提供有效的服务，本软件会利用你终端设备的处理器和带宽等资源。本软件使用过程中可能产生数据流量的费用，用户需自行向运营商了解相关资费信息，并自行承担相关费用。

				<br/>6.2.2 你理解并同意：本软件的某些功能可能会让第三方知晓用户的信息，例如：用户的好友可以查询用户头像、名字、一生名片账号等个人公开资料；使用手机号码注册一生名片帐号或手机号码与此帐号关联的用户，此帐号可以被通讯录存有该号码的好友查询。

				<br/>6.2.3 你理解并同意一生名片将会尽其商业上的合理努力保障你在本软件及服务中的数据存储安全。

				<br/>6.2.4 一生名片对你在本软件及服务中相关数据的删除或储存失败负责；并向你提供 电话服务支持，服务内容包括但不限于技术支持、产品使用帮助等。

				<br/>6.2.5 一生名片有权根据实际情况自行决定单个用户在本软件及服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。你可根据自己的需要自行备份本软件及服务中的相关个人数据；

				<br/>6.2.6 如果你停止使用本软件及服务或服务被终止或取消，一生名片可以从服务器上永久地删除你的数据。你需要在服务停止前自行备份你的个人数据，当服务停止、终止或取消后，一生名片没有义务返还你产生的全部数据。

				<br/>6.2.7 用户在使用本软件及服务时，须自行承担如下来自一生名片不可掌控的风险内容，包括但不限于：

				<br/>6.2.7.1 由于不可抗拒因素可能引起的个人信息丢失、泄漏等风险；

				<br/>6.2.7.2用户必须选择与所安装终端设备相匹配的软件版本，否则，由于软件与终端设备型号不相匹配所导致的任何问题或损害，均由用户自行承担；

				<br/>6.2.7.3 用户在使用本软件访问第三方网站时，因第三方网站及相关内容所可能导致的风险，由用户自行承担；

				<br/>6.2.7.4 用户发布的内容被他人转发、分享等传播可能带来的风险和责任；

				<br/>6.2.7.5由于无线网络信号不稳定、无线网络带宽小等原因，所引起的一生名片登录失败、资料同步不完整、页面打开速度慢等风险。

				<br/>6.2.8   服务变更、中断或终止：如发生下列任何一种情形，甲方有权随时中断或终止向用户提供本合同项下的平台使用服务（该服务包括但不限于收费及免费服务）而无需对用户承担任何责任：

				<br/>a）用户提供的资料不真实或套用其他人的资料注册导致其他人权利受损；
				<br/>b)用户违反本合同及附件、补充协议、甲方公布的使用规则、政策中规定的使用规则；
				<br/>c)用户在使用收费服务时未按规定向上海遇川实业发展有限公司支付相应的服务费用。

				<br/>6.2.9.一生名片承诺在有任何用户数据因服务器存储设备损坏时以最快的速度从最近的备份中恢复数据，但无法承诺100%的数据恢复。

				<br/>6.2.10.在发生需要从备份文件中恢复数据的情形时，一生名片通常需要1小时，最长48小时完成，在此时间范围内的数据恢复视作服务是连续的。

				<br/>6.2.11. 涉及你的信息与数据安全的重要操作，包括但不限于数据导出、密码重置、与资金相关的特殊数据查询、删除重要数据等，你必须向一生名片官方提出加盖公章或亲笔签名的书面申请，一生名片收讫相关申请资料后，48 小时内审核通过，方予变更或执行，一生名片有权在上述操作申请存在不确定性因素的情况下，向你进行核证或拒绝执行。

				<br/>6.3 第三方产品和服务

				<br/>6.3.1 你在使用本软件第三方提供的产品或服务时，除遵守本协议约定外，还应遵守第三方的用户协议。一生名片和第三方对可能出现的纠纷在法律规定和约定的范围内各自承担责任。

				<br/>6.3.2 因用户使用本软件或要求提供特定服务时，本软件可能会调用第三方系统或者通过第三方支持用户的使用或访问，使用或访问的结果由该第三方提供，通过第三方提供服务及内容的安全性、准确性、有效性及其他不确定的风险，由此若引发的任何争议及损害，与一生名片无关。

				<br/>6.3.3 你理解并同意，你无权决定将本软件用作非法的商业用途，包括但不限于直接开发、二次开发、暴力破解本软件的全部或部分功能、通过非法手段获取其他用户的个人信息，你不得使用本软件的部分功能或服务为本软件直接竞争对手的第三方作推广等。

			七、用户行为规范

				<br/>7.1 信息内容规范

				<br/>7.1.1 本条所述信息内容是指用户使用本软件及服务过程中所制作、复制、发布、传播的任何内容，包括但不限于头像、名字、用户说明等注册信息，或文字、语音、图片等发送、回复、跳转链接页面，以及其他使用本软件及服务所产生的内容。

				<br/>7.1.2 你理解并同意，一生名片一直致力于为用户提供文明健康、规范有序的网络环境，你不得利用帐号或本软件及服务制作、复制、发布、传播如下干扰一生名片正常运营，以及侵犯其他用户或第三方合法权益的内容，包括但不限于：

				<br/>7.1.2.1 发布、传送、传播、储存违反国家法律法规禁止的内容：
				<br/>（1）违反宪法确定的基本原则的；
				<br/>（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
				<br/>（3）损害国家荣誉和利益的；
				<br/>（4）煽动民族仇恨、民族歧视，破坏民族团结的；
				<br/>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；
				<br/>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；
				<br/>（7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；
				<br/>（8）侮辱或者诽谤他人，侵害他人合法权益的；
				<br/>（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序；
				<br/>（10）以非法民间组织名义活动的；
				<br/>（11）不符合《即时通信工具公众信息服务发展管理暂行规定》及遵守法律法规、社会主义制度、	<br/>国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的；
				<br/>（12）含有法律、行政法规禁止的其他内容的。

				<br/>7.1.2.2 发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；

				<br/>7.1.2.3 涉及他人隐私、个人信息或资料的；

				<br/>7.1.2.4 发表、传送、传播骚扰、广告信息、过度营销信息及垃圾信息或含有任何性或性暗示的；

				<br/>7.1.2.5 其他违反法律法规、政策及公序良俗、社会公德或干扰犯其他用户或第三方合法权益内容的信息。

				<br/>7.2 软件使用规范

				<br/>7.2.1 除非法律允许或一生名片书面许可，你使用本软件过程中不得从事下列行为：

				<br/>7.2.1.1 删除本软件及其副本上关于著作权的信息；

				<br/>7.2.1.2 对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码；

				<br/>7.2.1.3对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非一生名片授权的第三方工具/服务接入本软件和相关系统

				<br/>7.2.1.4  通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；

				<br/>7.2.1.5  通过非上海遇川实业发展有限公司开发、授权的第三方软件、插件、外挂、系统，登录或使用本软件及服务，或制作、发布、传播上述工具；

				<br/>7.2.1.6  自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰；

				<br/>7.2.1.7其他未经上海遇川实业发展有限公司明示授权的行为。

				<br/>7.2.2 你理解并同意，基于用户体验、一生名片或相关服务平台运营安全、平台规则要求及健康发展等综合因素，一生名片有权选择提供服务的对象，有权决定功能设置，有权决定功能开放、数据接口和相关数据披露的对象和范围。针对以下情形，有权视具体情况中止或终止提供本服务，包括但不限于：

				<br/>7.2.2.1 违反法律法规或本协议规定的；
				<br/>7.2.2.2 影响服务体验的；
				<br/>7.2.2.3 存在安全隐患的；
				<br/>7.2.2.4违背一生名片或其服务平台运营原则，或不符合一生名片管理要求的。

				<br/>7.3 服务运营规范

			除非法律允许或一生名片书面许可，你使用本服务过程中不得从事下列行为：

				<br/>7.3.1 提交、发布虚假信息，或冒充、利用他人名义的；
				<br/>7.3.2 诱导其他用户点击链接页面或分享信息的；
				<br/>7.3.3 虚构事实、隐瞒真相以误导、欺骗他人的；
				<br/>7.3.4 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的；
				<br/>7.3.5 本软件及服务从事任何违法犯罪活动的；
				<br/>7.3.6  制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的；

				<br/>7.3.7其他违反法律法规规定、侵犯其他用户合法权益、干扰产品正常运营或一生名片未明示授权的行为。

				<br/>7.4 对自己行为负责

			你充分了解并同意，你必须为自己注册帐号下的一切行为负责，包括你所发表的任何内容以及由此产生的任何后果。你应对本服务中的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险，一生名片无法且不会对因前述风险而导致的任何损失或损害承担责任。

				<br/>7.5 违约处理

				<br/>7.5.1 如果一生名片发现或收到他人举报或投诉用户违反本协议约定的，一生名片有权不经通知随时对相关内容进行删除、屏蔽，并视行为情节对违规帐号处以包括但不限于警告、限制或禁止使用部分或全部功能、帐号封禁直至注销的处罚以及公告处理结果。

				<br/>7.5.2 你理解并同意，一生名片有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应独自承担由此而产生的一切法律责任。

				<br/>7.5.3 你理解并同意，因你违反本协议或相关服务条款的规定，导致或产生第三方主张的任何索赔、要求或损失，你应当独立承担一生名片因此遭受损失的责任，你也应当一并赔偿。

			八、知识产权声明

				<br/>8.1 上海遇川实业发展有限公司是本软件的知识产权权利人。本软件的一切著作权、商标权、专利权、商业秘密等知识产权，以及与本软件相关的所有信息内容（包括但不限于文字、图片、音频、视频、图表、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规和相应的国际条约保护，上海遇川实业发展有限公司享有上述知识产权，但相关权利人依照法律规定应享有的权利除外。

				<br/>8.2 未经上海遇川实业发展有限公司或相关权利人书面同意，你不得为任何商业或非商业目的自行或许可任何第三方实施、利用、转让上述知识产权。

			九、终端安全责任

				<br/>9.1 你理解并同意，本软件同大多数互联网软件一样，可能会受多种因素影响，包括但不限于用户原因、网络服务质量、社会环境稳定等；也可能会受各种安全问题的侵扰，包括但不限于他人非法利用用户资料，进行现实中的骚扰；用户下载安装的其他软件或访问的其他网站中可能含有病毒、木马程序或其他恶意程序，威胁你的终端设备信息和数据安全，继而影响本软件的正常使用等。因此，你应加强信息安全及个人信息的保护意识，注意帐号及验证码保护，以免遭受损失。

				<br/>9.2 你不得制作、发布、使用、传播用于窃取他人帐号及他人个人信息、财产的恶意程序。

				<br/>9.3 维护软件安全与正常使用是一生名片和你的共同责任，一生名片将按照行业标准合理审慎地采取必要技术措施保护你的终端设备信息和数据安全，但是你承认和同意一生名片并不能就此提供完全保证。

				<br/>9.4 在任何情况下，你不应轻信借款、索要密码或其他涉及财产的网络信息。涉及财产操作的，请一定先核实对方身份，并请经常留意一生名片有关防范诈骗犯罪的提示。

			十、第三方软件或技术

				<br/>10.1 本软件可能会使用第三方软件或技术（包括本软件可能使用的开源代码和公共领域代码等，下同），这种使用已经获得合法授权。

				<br/>10.2 本软件如果使用了第三方的软件或技术，一生名片将按照相关法规或约定，对相关的协议或其他文件，可能通过本协议附件、在本软件安装包特定文件夹中打包、或通过开源软件页面等形式进行展示，它们可能会以“软件使用许可协议”、“授权协议”、“开源代码许可证”或其他形式来表达。前述通过各种形式展现的相关协议、其他文件及网页，均是本协议不可分割的组成部分，与本协议具有同等的法律效力，你应当遵守这些要求。如果你没有遵守这些要求，该第三方或者国家机关可能会对你提起诉讼、罚款或采取其他制裁措施，并要求一生名片给予协助，你应当自行承担法律责任。

				<br/>10.3 如因本软件使用的第三方软件或技术引发的任何纠纷，应由该第三方负责解决，一生名片不承担任何责任。一生名片不对第三方软件或技术提供客服支持，若你需要获取支持，请与第三方联系。

			十一、其他

				<br/>11.1 你使用本软件即视为你已阅读并同意受本协议的约束。上海遇川实业发展有限公司有权在必要时修改本协议条款。你可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果你继续使用本软件，即视为你已接受修改后的协议。如果你不接受修改后的协议，应当停止使用本软件。

				<br/>11.2 本协议签订地为中华人民共和国上海市浦东新区。

				<br/>11.3 本协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。

				<br/>11.4 若你和上海遇川实业发展有限公司之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，你同意将纠纷或争议提交本协议签订地有管辖权的人民法院管辖。

				<br/>11.5  本软件部分服务为收费服务，用户一经缴费，不论何种原因，上海遇川实业发展有限公司有权不予退还。

				<br/>11.6 本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。

				<br/>11.7 本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。（正文完）

			上海遇川实业发展有限公司

		</div>
	</div>
</template>

<script>
import Nav from '@/components/Nav';

export default {
	name: 'agreement',
	components: {
		'stm-nav':Nav
	},
	data () {
		return {
			navgationHeight:''
		}
	},
	onLoad() {
		wx.setNavigationBarTitle({
			title:'关于一生名片'
		})
		let startBarHeight = 20
		let navgationHeight = 44
		let that = this
		wx.getSystemInfo({
		  success: function (res) {
			if (res.model == 'iPhone X'){
			  startBarHeight = 44
			}
			that.navgationHeight= navgationHeight+startBarHeight
		  }
		})
	}
}
</script>

<style lang="less" scoped>
.agreement{
	h6{
		text-align:center;
		line-height:35px;
		font-size:18px;
		margin-top:10px;
	}
	.main{
		padding:20px;
		line-height:30px;
		font-size:15px;
		color:#999
	}
}
</style>
